Documents/ПроверкаЗнанияТребованийОхраныТруда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ПроверкаЗнанияТребованийОхраныТруда</Name>
			<BasedOn>
				<xr:Item>Document.ОбучениеСотрудниковОхранеТруда</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ПроверкиЗнанияТребованийОхраныТрудаСотрудников</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрограммаОбучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрограммыОбученияСотрудниковПоОхранеТруда</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаОбучения</Name>
					<Comment>Внутренняя/внешняя</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ФормыОбученияПоОхранеТруда</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбучениеСотрудников</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОбучениеСотрудниковОхранеТруда</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаОбучения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияОбучения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоУчебныхЧасов</Name>
					<Comment>АПК:58 различия имени и синонима оправданы. Длительность курса в часах</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчебноеЗаведение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчебныеЗаведения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПроверкиЗнания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПротоколаПроверкиЗнания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставДокумента</Name>
					<Comment>АПК:58 различия имени и синонима оправданы</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РезультатыОбучения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РабочееМесто</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РабочиеМестаОхраныТруда</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обучение</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ОбучениеСотрудниковОхранеТруда</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачалаОбучения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончанияОбучения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РезультатПроверкиЗнания</Name>
							<Type>
								<v8:Type>cfg:EnumRef.РезультатыПроверкиЗнанияПоОхранеТруда</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФизическиеЛица</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Комиссия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЧленКомиссии</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РольВКомиссии</Name>
							<Type>
								<v8:Type>cfg:EnumRef.РолиЧленовКомиссииОхраныТруда</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ПроверкиЗнанияТребованийОхраныТрудаСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ПроверкиЗнанияТребованийОхраныТрудаСотрудников</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПрограммаОбученияМинтруда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторПрограммОбученияПоОхранеТруда</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерПротокола</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РезультатПроверки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РезультатыПроверкиЗнанияПоОхранеТруда</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачалаОбучения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончанияОбучения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обучение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОбучениеСотрудниковОхранеТруда</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеМестаОхраныТруда</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГоловнаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПрограммаОбучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрограммыОбученияСотрудниковПоОхранеТруда</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ОбученияСотрудниковОхранеТрудаОжидающиеПроверки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ОбученияСотрудниковОхранеТрудаОжидающиеПроверки</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Обучение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОбучениеСотрудниковОхранеТруда</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Проверка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПроверкаЗнанияТребованийОхраныТруда</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаОбучения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияОбучения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеМестаОхраныТруда</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГоловнаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПрограммаОбучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрограммыОбученияСотрудниковПоОхранеТруда</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ФормыОбученияПоОхранеТруда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ФормыОбученияПоОхранеТруда</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Внутренняя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Внешняя</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/РезультатыПроверкиЗнанияПоОхранеТруда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>РезультатыПроверкиЗнанияПоОхранеТруда</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Удовлетворительно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неудовлетворительно</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ПроверкаЗнанияТребованийОхраныТруда/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ЗаполнитьПоПрограммеОбучения(ДанныеЗаполнения);
	ЗаполнитьНаОснованииОбучения(ДанныеЗаполнения, СтандартнаяОбработка);
	ЗаполнитьПоДаннымЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Проверка на отсутствие одинаковых сотрудников в ТЧ РезультатыОбучения.
	ЕстьОдинаковыеСотрудники = Ложь;
	Сотрудники = Новый Массив;
	Для Каждого СтрокаОбучения Из РезультатыОбучения Цикл
		ТекущийСотрудник = Новый Структура("ФизическоеЛицо, РабочееМесто", СтрокаОбучения.ФизическоеЛицо, СтрокаОбучения.РабочееМесто);
		Если Сотрудники.Найти(ТекущийСотрудник) = Неопределено Тогда
			Сотрудники.Добавить(ТекущийСотрудник);
			Продолжить;
		КонецЕсли;
		ИндексСтроки = РезультатыОбучения.Индекс(СтрокаОбучения);
		ТекстСообщения =
			СтрШаблон(НСтр("ru = 'Информация о сотруднике %1 на рабочем месте %2 уже была введена в документе ранее'"),
				СтрокаОбучения.ФизическоеЛицо, СтрокаОбучения.РабочееМесто);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Ссылка,
			СтрШаблон("Объект.РезультатыОбучения[%1].ФизическоеЛицо", Формат(ИндексСтроки, "ЧН=0; ЧГ=0")), ,Отказ);
		ЕстьОдинаковыеСотрудники = Истина;
	КонецЦикла;

	Если ЕстьОдинаковыеСотрудники Тогда
		Возврат
	КонецЕсли;
	
	Если ФормаОбучения = Перечисления.ФормыОбученияПоОхранеТруда.Внутренняя Тогда
		ОхранаТруда.ОбработкаПроверкиЗаполненияКомиссии(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "УчебноеЗаведение");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОбучениеСотрудников) Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "ДатаНачалаОбучения");
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "ДатаОкончанияОбучения");
	Иначе
		Если ДатаНачалаОбучения > ДатаОкончанияОбучения Тогда
			ОбщегоНазначения.СообщитьПользователю(
				НСтр("ru='Дата окончания обучения не может быть меньше даты начала'"),
				ЭтотОбъект, "ДатаОкончания", ,Отказ);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	ЗарплатаКадрыРасширенный.ИнициализироватьОтложеннуюРегистрациюВторичныхДанныхПоДвижениямДокумента(Движения);
	
	ПроверитьНаличиеПроверокПоОбучению(ОбучениеСотрудников);
	
	ДанныеДляПроведения = ДанныеДляПроведения();
	ЗарегистрироватьОбучениеПоОхранеТруда(Движения, ДанныеДляПроведения.РезультатыОбучения);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Если ФормаОбучения = Перечисления.ФормыОбученияПоОхранеТруда.Внешняя Тогда
		Комиссия.Очистить();
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьСформированноеОбучение();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДанныеДляПроведения()
	
	ДанныеДляПроведения = Новый Структура();
	ДанныеДляПроведения.Вставить("МенеджерВременныхТаблиц",	Новый МенеджерВременныхТаблиц);
	ДанныеДляПроведения.Вставить("РезультатыОбучения",		Неопределено);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = ДанныеДляПроведения.МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ДатаПроверкиЗнания", ДатаПроверкиЗнания);
	
	ДобавитьДанныеДляПроведенияРезультатыОбучения(Запрос, ДанныеДляПроведения);
	
	Возврат ДанныеДляПроведения;
	
КонецФункции 

Процедура ДобавитьДанныеДляПроведенияРезультатыОбучения(Запрос, ДанныеДляПроведения)
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПроверкаЗнания.Ссылка КАК Регистратор,
	|	ПроверкаЗнания.ДатаПроверкиЗнания КАК Период,
	|	ПроверкаЗнания.Номер КАК Номер,
	|	ПроверкаЗнания.НомерПротоколаПроверкиЗнания КАК НомерПротокола,
	|	ПроверкаЗнания.Организация КАК Организация,
	|	ПроверкаЗнания.ПрограммаОбучения КАК ПрограммаОбучения,
	|	ПроверкаЗнания.ПрограммаОбучения.ПрограммаОбученияМинтруда КАК ПрограммаОбученияМинтруда,
	|	ПроверкаЗнания.ДатаНачалаОбучения КАК ДатаНачалаОбучения,
	|	ПроверкаЗнания.ДатаОкончанияОбучения КАК ДатаОкончанияОбучения,
	|	ПроверкаЗнанияРезультатыОбучения.РабочееМесто КАК РабочееМесто,
	|	ПроверкаЗнанияРезультатыОбучения.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ПроверкаЗнанияРезультатыОбучения.Обучение КАК Обучение,
	|	ПроверкаЗнанияРезультатыОбучения.РезультатПроверкиЗнания КАК РезультатПроверки
	|ИЗ
	|	Документ.ПроверкаЗнанияТребованийОхраныТруда КАК ПроверкаЗнания
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПроверкаЗнанияТребованийОхраныТруда.РезультатыОбучения КАК
	|			ПроверкаЗнанияРезультатыОбучения
	|		ПО ПроверкаЗнания.Ссылка = ПроверкаЗнанияРезультатыОбучения.Ссылка
	|ГДЕ
	|	ПроверкаЗнания.Ссылка = &Ссылка";
	
	ДанныеДляПроведенияРезультатыОбучения = Запрос.Выполнить().Выгрузить();
	Для Каждого СтрокаДанных Из ДанныеДляПроведенияРезультатыОбучения Цикл
		СтрокаДанных.НомерПротокола = ЗарплатаКадрыОтчеты.НомерНаПечать(СтрокаДанных.Номер, СтрокаДанных.НомерПротокола);
	КонецЦикла;
	ДанныеДляПроведения.Вставить("РезультатыОбучения", ДанныеДляПроведенияРезультатыОбучения);
	
КонецПроцедуры

Процедура ЗарегистрироватьОбучениеПоОхранеТруда(Движения, ОбучениеПоОхранеТруда)
	
	ГоловнаяОрганизация = ЗарплатаКадры.ГоловнаяОрганизация(Организация);
	Для Каждого Строка Из ОбучениеПоОхранеТруда Цикл
		НоваяСтрока = Движения.ПроверкиЗнанияТребованийОхраныТрудаСотрудников.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		НоваяСтрока.ГоловнаяОрганизация = ГоловнаяОрганизация;
		Движения.ПроверкиЗнанияТребованийОхраныТрудаСотрудников.Записывать = Истина;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьНаОснованииОбучения(ОбучениеСсылка, СтандартнаяОбработка)
	
	Если ТипЗнч(ОбучениеСсылка) <> Тип("ДокументСсылка.ОбучениеСотрудниковОхранеТруда") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ОбучениеСсылка) Тогда
		Возврат;
	КонецЕсли;
	
	ПроверитьНаличиеПроверокПоОбучению(ОбучениеСсылка);
	
	СтандартнаяОбработка = Ложь;
	
	ОбучениеСотрудников = ОбучениеСсылка;
	
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ОбучениеСсылка,
		"Организация, Подразделение, ПрограммаОбучения, ФормаОбучения, ДатаНачалаОбучения, ДатаОкончанияОбучения,
		|КоличествоУчебныхЧасов, УчебноеЗаведение, Контрагент, Сотрудники");
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ЗначенияРеквизитов);
	
	Для Каждого Строка Из ЗначенияРеквизитов.Сотрудники.Выгрузить() Цикл
		НоваяСтрока = РезультатыОбучения.Добавить();
		НоваяСтрока.ФизическоеЛицо = Строка.ФизическоеЛицо;
		НоваяСтрока.РабочееМесто = Строка.РабочееМесто;
		НоваяСтрока.Обучение = ОбучениеСотрудников;
		НоваяСтрока.ДатаНачалаОбучения = ЗначенияРеквизитов.ДатаНачалаОбучения;
		НоваяСтрока.ДатаОкончанияОбучения = ЗначенияРеквизитов.ДатаОкончанияОбучения;
		НоваяСтрока.РезультатПроверкиЗнания = Перечисления.РезультатыПроверкиЗнанияПоОхранеТруда.Удовлетворительно;
	КонецЦикла;
	
	ЗаполнитьЗначенияПоУмолчанию();
	
КонецПроцедуры

Процедура ЗаполнитьПоДаннымЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	
	Если ДанныеЗаполнения.Свойство("ФизическиеЛицаРабочиеМеста") Тогда
		ЗаполнитьСотрудниковПоТаблицеЗначений(ДанныеЗаполнения.ФизическиеЛицаРабочиеМеста);
	ИначеЕсли ЗначениеЗаполнено(ОбучениеСотрудников) Тогда
		ЗаполнитьНаОснованииОбучения(ОбучениеСотрудников, СтандартнаяОбработка);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПрограммаОбучения) Тогда
		ЗаполнитьПоПрограммеОбучения(ПрограммаОбучения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьПоПрограммеОбучения(ПрограммаОбученияСсылка)
	
	Если ТипЗнч(ПрограммаОбученияСсылка) <> Тип("СправочникСсылка.ПрограммыОбученияСотрудниковПоОхранеТруда") Тогда
		Возврат;
	КонецЕсли;

	КоличествоУчебныхЧасов = Неопределено;
	Контрагент = Неопределено;
	УчебноеЗаведение = Неопределено;
	ФормаОбучения = Неопределено;
	
	ПрограммаОбучения = ПрограммаОбученияСсылка;
	Если ЗначениеЗаполнено(ПрограммаОбучения) Тогда
		ИменаРеквизитов = Новый Массив;
		ИменаРеквизитов.Добавить("КоличествоУчебныхЧасов"); 
		ИменаРеквизитов.Добавить("Контрагент");
		ИменаРеквизитов.Добавить("УчебноеЗаведение");
		ИменаРеквизитов.Добавить("ФормаОбучения");
		ДанныеПрограммы = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПрограммаОбученияСсылка, ИменаРеквизитов);
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеПрограммы);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьСотрудниковПоТаблицеЗначений(ФизическиеЛицаРабочиеМеста, ИмяКолонкиРабочееМесто = "РабочееМесто")
	
	Обучения = ОбщегоНазначения.ВыгрузитьКолонку(ФизическиеЛицаРабочиеМеста, "Обучение", Истина);
	ОбщегоНазначенияБЗККлиентСервер.УдалитьПустыеЗначенияИзМассива(Обучения);
	ДатыОбучений = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(Обучения, "ДатаНачалаОбучения, ДатаОкончанияОбучения");
	
	Для Каждого ФизическоеЛицоРабочееМесто Из ФизическиеЛицаРабочиеМеста Цикл
		НоваяСтрока = РезультатыОбучения.Добавить();
		НоваяСтрока.ФизическоеЛицо = ФизическоеЛицоРабочееМесто.ФизическоеЛицо;
		НоваяСтрока.РабочееМесто = ФизическоеЛицоРабочееМесто[ИмяКолонкиРабочееМесто];
		НоваяСтрока.Обучение = ФизическоеЛицоРабочееМесто.Обучение;
		Если ЗарплатаКадры.ЕстьПолеВСтрокеКоллекции(ФизическоеЛицоРабочееМесто, "ДатаНачалаОбучения") Тогда
			НоваяСтрока.ДатаНачалаОбучения = ФизическоеЛицоРабочееМесто.ДатаНачалаОбучения;
		ИначеЕсли ДатыОбучений[НоваяСтрока.Обучение] <> Неопределено Тогда
			НоваяСтрока.ДатаНачалаОбучения = ДатыОбучений[НоваяСтрока.Обучение].ДатаНачалаОбучения;
		КонецЕсли;
		Если ЗарплатаКадры.ЕстьПолеВСтрокеКоллекции(ФизическоеЛицоРабочееМесто, "ДатаОкончанияОбучения") Тогда
			НоваяСтрока.ДатаОкончанияОбучения = ФизическоеЛицоРабочееМесто.ДатаОкончанияОбучения;
		ИначеЕсли ДатыОбучений[НоваяСтрока.Обучение] <> Неопределено Тогда
			НоваяСтрока.ДатаОкончанияОбучения = ДатыОбучений[НоваяСтрока.Обучение].ДатаОкончанияОбучения;
		КонецЕсли;
		НоваяСтрока.РезультатПроверкиЗнания = Перечисления.РезультатыПроверкиЗнанияПоОхранеТруда.Удовлетворительно;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьСотрудниковПоПрограммеОбучения(КадровыеДанныеСотрудников = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	ОбучениеПоОхранеТруда.СоздатьВТСотрудникиОжидающиеПроверку(
		Запрос.МенеджерВременныхТаблиц, ПрограммаОбучения, ДатаНачалаОбучения, ДатаОкончанияОбучения);
	Если КадровыеДанныеСотрудников = Неопределено Тогда
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	СотрудникиОжидающиеПроверку.ФизическоеЛицо КАК ФизическоеЛицо,
			|	СотрудникиОжидающиеПроверку.РабочееМесто КАК РабочееМесто,
			|	СотрудникиОжидающиеПроверку.Обучение КАК Обучение,
			|	СотрудникиОжидающиеПроверку.ДатаНачалаОбучения КАК ДатаНачалаОбучения,
			|	СотрудникиОжидающиеПроверку.ДатаОкончанияОбучения КАК ДатаОкончанияОбучения
			|ИЗ
			|	ВТСотрудникиОжидающиеПроверку КАК СотрудникиОжидающиеПроверку";
	Иначе
		Запрос.УстановитьПараметр("СотрудникиОрганизации", КадровыеДанныеСотрудников);
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	СотрудникиОрганизации.ФизическоеЛицо КАК ФизическоеЛицо,
			|	СотрудникиОрганизации.РабочееМестоОхраныТруда КАК РабочееМестоОхраныТруда
			|ПОМЕСТИТЬ ВТСотрудникиОрганизации
			|ИЗ
			|	&СотрудникиОрганизации КАК СотрудникиОрганизации
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	СотрудникиОрганизации.ФизическоеЛицо КАК ФизическоеЛицо,
			|	СотрудникиОрганизации.РабочееМестоОхраныТруда КАК РабочееМесто,
			|	СотрудникиОжидающиеПроверку.Обучение КАК Обучение,
			|	СотрудникиОжидающиеПроверку.ДатаНачалаОбучения КАК ДатаНачалаОбучения,
			|	СотрудникиОжидающиеПроверку.ДатаОкончанияОбучения КАК ДатаОкончанияОбучения
			|ИЗ
			|	ВТСотрудникиОрганизации КАК СотрудникиОрганизации
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСотрудникиОжидающиеПроверку КАК СотрудникиОжидающиеПроверку
			|		ПО СотрудникиОжидающиеПроверку.ФизическоеЛицо = СотрудникиОрганизации.ФизическоеЛицо";
	КонецЕсли;
	
	ЗаполнитьСотрудниковПоТаблицеЗначений(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

Процедура ЗаполнитьЗначенияПоУмолчанию()
	
	ЗначенияПоУмолчанию = Новый Структура("Ответственный");
	ЗарплатаКадры.ПолучитьЗначенияПоУмолчанию(ЗначенияПоУмолчанию);
	Ответственный = ЗначенияПоУмолчанию.Ответственный;
	
КонецПроцедуры

Процедура ОбновитьСформированноеОбучение()
	
	// Если документ проводится, то обучение считается погашенным, запись о сформированном обучении удаляем.
	// В случае записи или отмены проведения запись нужно обновить, вписав туда обучение, или создать, если ее пока нет.
	
	Если ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		СоздатьЗаписиСформированногоОбучения();
		Возврат;
	КонецЕсли;
	
	ДатыОбучения = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(РезультатыОбучения.ВыгрузитьКолонку("Обучение"), "Дата");
	Для Каждого Строка Из РезультатыОбучения Цикл
		Если Не ЗначениеЗаполнено(Строка.Обучение) Тогда
			Продолжить;
		КонецЕсли;
		НаборЗаписей = РегистрыСведений.ОбученияСотрудниковОхранеТрудаОжидающиеПроверки.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ФизическоеЛицо.Установить(Строка.ФизическоеЛицо);
		НаборЗаписей.Отбор.РабочееМесто.Установить(Строка.РабочееМесто);
		НаборЗаписей.Отбор.ПрограммаОбучения.Установить(ПрограммаОбучения);
		ДатаОбучения = НачалоДня(ДатыОбучения.Получить(Строка.Обучение));
		НаборЗаписей.Отбор.Период.Установить(ДатаОбучения);
		Если ДополнительныеСвойства.РежимЗаписи <> РежимЗаписиДокумента.Проведение Тогда
			СтрокаНабора = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаНабора, Строка);
			СтрокаНабора.Период = ДатаОбучения;
			СтрокаНабора.ПрограммаОбучения = ПрограммаОбучения;
			СтрокаНабора.Организация = Организация;
			СтрокаНабора.ГоловнаяОрганизация = ЗарплатаКадры.ГоловнаяОрганизация(Организация);
			СтрокаНабора.Проверка = Ссылка;
		КонецЕсли;
		НаборЗаписей.Записать();
	КонецЦикла;
	
КонецПроцедуры

Процедура СоздатьЗаписиСформированногоОбучения()
	
	ДатыОбучения = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(РезультатыОбучения.ВыгрузитьКолонку("Обучение"), "Дата");
	Для Каждого СтрокаТаблицы Из РезультатыОбучения Цикл
		Если Не ЗначениеЗаполнено(СтрокаТаблицы.Обучение) Тогда
			Продолжить;
		КонецЕсли;
		НаборЗаписей = РегистрыСведений.ОбученияСотрудниковОхранеТрудаОжидающиеПроверки.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ФизическоеЛицо.Установить(СтрокаТаблицы.ФизическоеЛицо);
		НаборЗаписей.Отбор.РабочееМесто.Установить(СтрокаТаблицы.РабочееМесто);
		НаборЗаписей.Отбор.ПрограммаОбучения.Установить(ПрограммаОбучения);
		ДатаОбучения = ДатыОбучения.Получить(СтрокаТаблицы.Обучение);
		НаборЗаписей.Отбор.Период.Установить(ДатаОбучения);
		СтрокаНабора = НаборЗаписей.Добавить();
		СтрокаНабора.ФизическоеЛицо = СтрокаТаблицы.ФизическоеЛицо;
		СтрокаНабора.РабочееМесто = СтрокаТаблицы.РабочееМесто;
		СтрокаНабора.ПрограммаОбучения = ПрограммаОбучения;
		СтрокаНабора.Организация = Организация;
		СтрокаНабора.ГоловнаяОрганизация = ЗарплатаКадры.ГоловнаяОрганизация(Организация);
		СтрокаНабора.Период = ДатаОбучения;
		СтрокаНабора.Обучение = СтрокаТаблицы.Обучение;
		СтрокаНабора.ДатаНачалаОбучения = СтрокаТаблицы.ДатаНачалаОбучения;
		СтрокаНабора.ДатаОкончанияОбучения = СтрокаТаблицы.ДатаОкончанияОбучения;
		СтрокаНабора.Проверка = Ссылка;
		НаборЗаписей.Записать();
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьНаличиеПроверокПоОбучению(ОбучениеСсылка)
	
	Если Не ЗначениеЗаполнено(ОбучениеСсылка) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Обучение", ОбучениеСсылка);
	Запрос.УстановитьПараметр("Проверка", Ссылка);
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПроверкиЗнания.Ссылка КАК Проверка
		|ИЗ
		|	Документ.ПроверкаЗнанияТребованийОхраныТруда КАК ПроверкиЗнания
		|ГДЕ
		|	ПроверкиЗнания.ОбучениеСотрудников = &Обучение
		|	И ПроверкиЗнания.Проведен
		|	И ПроверкиЗнания.Ссылка <> &Проверка";
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	ТекстСообщения =
		СтрШаблон(НСтр("ru = 'На основании документа %1 уже проведен документ %2'"), ОбучениеСсылка, Выборка.Проверка);
	
	ВызватьИсключение ТекстСообщения;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
